Tekla.Structures.Geometry3d.SolidEx
The Tekla.Structures.Geometry3d.SolidEx class provides relations from edges to the faces that they bound.

Tekla.Structures.Geometry3d.SolidEx.edgeFaces
The dictionary between the edge segments in the solid and the two faces that they bound.

Tekla.Structures.Geometry3d.SolidEx.#ctor(Tekla.Structures.Solid.ISolid)
Initializes a new instance of the Tekla.Structures.Geometry3d.SolidEx class.
solid: The solid.

Tekla.Structures.Geometry3d.SolidEx.#ctor(System.Collections.Generic.IEnumerable{Tekla.BIM.Geometry.Face3})
Initializes a new instance of the Tekla.Structures.Geometry3d.SolidEx class.
faces: A list of Tekla.BIM.Geometry.Face3 instances.

Tekla.Structures.Geometry3d.SolidEx.Faces
Gets the faces in the solid.

Tekla.Structures.Geometry3d.SolidEx.AddEdgeFaces(Tekla.BIM.Geometry.Face3)
The add edge faces.
face:
The face.

Tekla.Structures.Geometry3d.SolidEx.TryGetAdjacentFace(Tekla.BIM.Geometry.Face3,Tekla.Common.Geometry.Segment3,Tekla.BIM.Geometry.Face3@)
Gets the face adjacent to the specified face at the common specified edge.
face: The face.
edge: The common edge.
adjacentFace: The adjacent face.
Returns: True if the adjacent face was found; otherwise, false.

Tekla.Structures.Geometry3d.SolidEx.FindFace(Tekla.Common.Geometry.Segment3)
Finds the face that contains the specified line segment.
segment: The line segment.
Returns: The face.

Tekla.Structures.Geometry3d.SolidEx.FindEdge(Tekla.Common.Geometry.Vector3)
Finds an edge that contains the given point.
point: The point.
Returns: The first edge.

Tekla.Structures.Geometry3d.SolidEx.Clean
Cleans the solid merging all coplanar connected faces.

Tekla.Structures.Geometry3d.SolidEx.ExtractPoints(System.Collections.Generic.IList{Tekla.Common.Geometry.Vector3},System.Int32,System.Int32)
Creates a list of points that is a subset of the given list.
source: The source list of points.
start: The start index.
end: The end index.
Returns: A list of points.

Tekla.Structures.Geometry3d.SolidEx.RemoveCutEdge(Tekla.Common.Geometry.Segment3,Tekla.BIM.Geometry.Face3)
Removes the given edge from one of the cuts of the given face.
edge: The edge.
face: The face.
Returns: The resulting Tekla.BIM.Geometry.Face3

Tekla.Structures.Geometry3d.SolidEx.RemoveEdge(Tekla.Common.Geometry.Segment3,Tekla.BIM.Geometry.Face3)
Remove the edge if it is a dangling edge - twice in the outer loop. If removing it would
split the outer loop into 2 then just return a copy of the face.
edge: The edge to remove
face: The face from which to remove it.
Returns: An instance of the Tekla.BIM.Geometry.Face3 with the edge removed.

Tekla.Structures.Geometry3d.SolidEx.FindEdge(System.Collections.Generic.IList{Tekla.Common.Geometry.Vector3},Tekla.Common.Geometry.Segment3)
Finds the given edge in the given polygon.
polygon: The polygon.
edge: The edge.
Returns: A tuple of integers of the polygons indexes of the edge.

Tekla.Structures.Geometry3d.SolidEx.MergeFaces(Tekla.Common.Geometry.Segment3,Tekla.BIM.Geometry.Face3,Tekla.BIM.Geometry.Face3)
Merge the faces.
commonEdge: The common edge.
firstFace: The first face.
secondFace: The second face.
Returns: A list of points that define the merged outer boundary.

Tekla.Structures.Geometry3d.SolidEx.ReplaceFaces(System.Collections.Generic.ICollection{Tekla.BIM.Geometry.Face3},Tekla.BIM.Geometry.Face3)
Replaces any instances of the given faces with the Tekla.BIM.Geometry.Face3 instance.
facesToRemove: The faces to be removed.
newFace: The face which is to replace the others.

Tekla.Structures.Geometry3d.SolidEx.TryGetFaces(Tekla.Common.Geometry.Segment3,System.Tuple{Tekla.BIM.Geometry.Face3,Tekla.BIM.Geometry.Face3}@)
Gets the two faces at the specified edge segment.
edge: The edge segment.
faces: The two faces in a tuple.
Returns: True is the edge segment exists in the solid; otherwise, false.